<?php

$num = 5 ; 
$location = 'дереві' ; 
$format = '%d мавп сидять на %s' ; 
printf ( '%d мавп сидять на %s', $num, $location ); // 5 мавп сидять на дереві
$num = 25 ;
$location = 'столі' ; 
echo "\n";
printf ( $format, $num, $location );

$format = 'На %2$s сидять %1$d мавп ' ; 
printf ( 'На %2$s сидять %1$d мавп ', $num, $location ); // На дереві сидять 5 мавп

$s = 'monkey'; // у рядку 5 символів 
$t = 'many monkeys'; // у рядку 10 символів
printf ( "[%s]\n" , $s ); // звичайний висновок рядка: [monkey]
printf ( "[%10s]\n" , $s ); // вирівнювання рядка вправо, відступ заповнюється пробілами: [ monkey]
printf ( "[%-10s]\n" , $s ); // вирівнювання рядка вліво, відступ заповнюється пробілами: [monkey ]
printf("[%15.10s]\n", $t); // загальна довжина - 15 символів, вирівнювання рядка вправо, рядок обрізається до 10 символів, відступ заповнюється пробілами: [ many monke]
printf("[%'#15.10s]\n", $t); // загальна довжина - 15 символів, вирівнювання рядка вправо, рядок обрізається до 10 символів, відступ заповнюється крапками: [.....many monke]

$money1  =  68.75 ;  
$money2  =  54.35 ; 
$number = 362525200;
$money  =  $money1  +  $money2 ; 
echo $money."\n"; //виведе "123.1"; 
$formatted  =  sprintf ( "%.2f" ,  $money ); 
echo $formatted."\n"; //  виведе "123.10"
$formatted  =  sprintf("%010.3f" ,  $money); 
echo $formatted."\n"; //  виведе "000123.100"
echo sprintf("%.3e", $number); // виведе 3.625e+8