<?php

$phrase = "Ви повинні їсти фрукти кожного дня."; // об’єкт - рядок
$phrase1 = "Ви повинні їсти цукерки кожного дня."; // об’єкт - рядок
$healthy = "фрукти"; // значення, яке будемо замінювати
$sweets = "цукерки"; // значення, яким будемо замінювати
$newphrase = str_replace($sweets, $healthy, $phrase1); // робимо заміну
echo $newphrase; // Ви повинні їсти цукерки кожного дня.

$phrase3 = "Привіт усім! Привіт, дорога!"; // об’єкт - рядок
$hello1 = "Привіт"; // значення, яке будемо замінювати
$hello2 = "Доброго ранку"; // значення, яким будемо замінювати
$newphrase = str_replace($hello1, $hello2, $phrase3); // робимо заміну
echo $newphrase; // Доброго ранку усім! Доброго ранку, дорога!

$greeting = [
    "Привіт",
    "Привіт усім!",
    "Привіт, дорога!"]; // об’єкт – масив
$new_greet = str_replace("Привіт", "Доброго ранку", $greeting);
// робимо заміну
print_r($new_greet);

$greeting = array("Привіт",
"Привіт усім!",
"Привіт, дорога!",
"Здрастуйте",
"Hello!",
"Hi"
); // вихідний масив
$search = array ("Привіт",
"Здрастуйте",
"Hi"); // значення, які будемо замінювати
$replace = array ("Доброго ранку",
"День добрий", "Welcome"); // значення, якими будемо замінювати
$new_greet = str_replace($search, $replace, $greeting); // робимо заміну
print_r($new_greet); //виводимо отриманий масив


$greeting = array("Привіт",
"Привіт усім!",
"Привіт, дорога!",
"Здрастуйте",
"Здрастуйте, друзі!"
); // об’єкт – масив
$search = array ("Привіт",
"Здрастуйте"
); // значення, які будемо заменювати
$replace = "День добрий"; // значення, яким будемо замінявати
$new_greet = str_replace($search, $replace, $greeting); // робимо заміну
print_r($new_greet); //виводимо отриманий масив


$phrase4 = "Ви повинні їсти фрукти та овочі кожного дня."; // об’єкт – рядок
$healthy = array("фрукти", "овочі"); // значення, які будемо замінювати
$sweets = array("цукерки", "морозиво"); // значення, якими будемо замінювати
$newphrase = str_replace($healthy, $sweets, $phrase4); // робимо заміну
echo $newphrase; // Ви повинні їсти цукерки та морозиво кожного дня.


$text = "Мене звуть Василько.";
echo "$text\n";
//Функція замінить вихідний рядок рядком 'А мене – Петрик'
echo substr_replace($text, 'А мене – Петрик', 0) . "\n";
// Наступний рядок додасть слово 'Привіт! ‘ до початку вихідного рядку
echo substr_replace($text, 'Привіт! ', 0, 0) . "\n";